app/controllers/movies_controller.rb

  def index

    Movie.select("distinct rating").each do |m|
---
SELECT DISTINCT rating FROM "movies"


    if sort_by
      if ratings_condition
         @movies = Movie.where(:rating => ratings_condition).order(sort_by)
      else
         @movies = Movie.order(sort_by)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG') ORDER BY release_date
SELECT "movies".* FROM "movies" ORDER BY release_date